In [2]:
import pandas as pd
import numpy as np

### 1. WAP using Pandas to create a series from a list, numpy array and dict

In [6]:
print("Series from list:")
x = pd.Series([10, 20, 30, 40, 50], index =['a', 'b', 'c', 'd', 'e'])
print(x)
print("\n")

print("Series from numpy array:")
data = np.array(['a', 'b', 'c', 'd', 'e'])
  # creating series
s = pd.Series(data)
print(s)
print("\n")

print("Series from dict:")
# create a dictionary
dictionary = {'A' : 10, 'B' : 20, 'C' : 30}
  # create a series
series = pd.Series(dictionary)
  
print(series)

Series from list:
a    10
b    20
c    30
d    40
e    50
dtype: int64


Series from numpy array:
0    a
1    b
2    c
3    d
4    e
dtype: object


Series from dict:
A    10
B    20
C    30
dtype: int64

### 2.WAP using Pandas to convert the index of a series into a column of a dataframe

In [8]:
s = pd.Series(['C', 'C++', 'Java', 
               'Python', 'Perl', 'Ruby',
               'Julia'])
  
# using series.to_frame to
# convert series to dataframe
df = s.to_frame().reset_index()
df

   index       0
0      0       C
1      1     C++
2      2    Java
3      3  Python
4      4    Perl
5      5    Ruby
6      6   Julia

### 3.WAP using Pandas to combine many series to form a dataframe

In [13]:
x = pd.Series(['AA', 'BB', 'CC', 'DD', 'EE'])
s = pd.Series(['C', 'C++', 'Java', 
               'Python', 'Perl'])
m = pd.Series([1,3,5,np.nan,6])
data = {"students": x,
        "subject": s,
        "marks": m}
df = pd.concat(data,axis = 1)
df

  students subject  marks
0       AA       C    1.0
1       BB     C++    3.0
2       CC    Java    5.0
3       DD  Python    NaN
4       EE    Perl    6.0

### 4.WAP using Pandas to add, subtract, multiple and divide two Pandas Series.

In [16]:
x = pd.Series([10, 20, 30, 40, 50])
y = pd.Series([60, 70, 50, 20, 10])
print("subtraction:")
subs=(x-y)
print(subs)
print("\n")
print("addition:")
add=(x+y)
print(add)
print("\n")
print("multiplication:")
mul=(x*y)
print(mul)
print("\n")
print("division:")
div=(x/y)
print(div)
print("\n")

subtraction:
0   -50
1   -50
2   -20
3    20
4    40
dtype: int64


addition:
0    70
1    90
2    80
3    60
4    60
dtype: int64


multiplication:
0     600
1    1400
2    1500
3     800
4     500
dtype: int64


division:
0    0.166667
1    0.285714
2    0.600000
3    2.000000
4    5.000000
dtype: float64

### 5.WAP using Pandas to compare the elements of the two Pandas Series.

In [17]:
x = pd.Series([10, 20, 30, 40, 50])
y = pd.Series([60, 70, 50, 20, 10])
(x>y)

0    False
1    False
2    False
3     True
4     True
dtype: bool

### 6.WAP using Pandas to create a datafame as follows
    ### Name  Score    Attempts    Qualify
        Ana    45       5          no
        Priya  65       3          yes
        Charu  78       4          yes
        Suchi  12       4          no
        Richa  4        2          no

In [26]:
'''a = pd.Series(['Ana', 'Priya', 'Charu', 'Suchi', 'Richa'])
b = pd.Series([45,65,78,12,4])
c = pd.Series([5,3,4,4,2])
d= pd.Series(['no','yes','yes','no','no'])
data = {"Name": a,
        "Score": b,
        "Attempts": c,
        "Qualify":d}
df = pd.DataFrame(data)
df'''

df2=pd.DataFrame({'Name':(['Ana', 'Priya', 'Charu', 'Suchi', 'Richa']),
                  'Score':([45,65,78,12,4]),
                  'Attempts':([5,3,4,4,2]),
                  'Qualify':(['no','yes','yes','no','no'])
                 })
df2

    Name  Score  Attempts Qualify
0    Ana     45         5      no
1  Priya     65         3     yes
2  Charu     78         4     yes
3  Suchi     12         4      no
4  Richa      4         2      no

### 7. WAP using Pandas to get the first 3 rows of a given DataFrame.

In [23]:
df.head(3)

    Name  Score  Attempts Qualify
0    Ana     45         5      no
1  Priya     65         3     yes
2  Charu     78         4     yes

### 8.WAP using Pandas to select the 'name' and 'score' columns from the following DataFrame.

In [27]:
df.loc[:,['Name','Score']]

    Name  Score
0    Ana     45
1  Priya     65
2  Charu     78
3  Suchi     12
4  Richa      4

### 9.WAP using Pandas to select the specified columns and rows from a given data frame.

### 10.WAP using Pandas  to select the rows the score is between 0 and 20.

In [28]:
df[df.Score<20]

    Name  Score  Attempts Qualify
3  Suchi     12         4      no
4  Richa      4         2      no

### 11.WAP using Pandas to select the rows where number of attempts in the examination is less than 4 and score greater than 50.

In [30]:
(df[(df['Attempts'] < 4) & (df['Score'] > 50)])

    Name  Score  Attempts Qualify
1  Priya     65         3     yes

### 12.WAP using Pandas  to calculate the sum of the examination attempts by the students.

In [34]:
print("\nSum of the examination attempts by the students:")
print(df['Attempts'].sum())

Sum of the examination attempts by the students:
18